{"dataset": ["coffee_d0"], "language_idx": {"I need to make slight adjustments to the position of the end effector.": 0, "I need to move arm backward and downward with gripper closed.": 1, "I need to move arm backward and downward with gripper open.": 2, "I need to move arm backward and left with gripper closed.": 3, "I need to move arm backward and left with gripper open.": 4, "I need to move arm backward and right with gripper closed.": 5, "I need to move arm backward and right with gripper open.": 6, "I need to move arm backward and upward with gripper closed.": 7, "I need to move arm backward and upward with gripper open.": 8, "I need to move arm backward with gripper closed.": 9, "I need to move arm backward with gripper open.": 10, "I need to move arm downward and forward with gripper closed.": 11, "I need to move arm downward and forward with gripper open.": 12, "I need to move arm downward and left with gripper closed.": 13, "I need to move arm downward and left with gripper open.": 14, "I need to move arm downward and right with gripper closed.": 15, "I need to move arm downward and right with gripper open.": 16, "I need to move arm downward with gripper closed.": 17, "I need to move arm downward with gripper open.": 18, "I need to move arm forward and left with gripper closed.": 19, "I need to move arm forward and left with gripper open.": 20, "I need to move arm forward and right with gripper closed.": 21, "I need to move arm forward and right with gripper open.": 22, "I need to move arm forward and upward with gripper closed.": 23, "I need to move arm forward and upward with gripper open.": 24, "I need to move arm forward with gripper closed.": 25, "I need to move arm forward with gripper open.": 26, "I need to move arm left and upward with gripper closed.": 27, "I need to move arm left and upward with gripper open.": 28, "I need to move arm left with gripper closed.": 29, "I need to move arm left with gripper open.": 30, "I need to move arm right and upward with gripper closed.": 31, "I need to move arm right and upward with gripper open.": 32, "I need to move arm right with gripper closed.": 33, "I need to move arm right with gripper open.": 34, "I need to move arm upward with gripper closed.": 35, "I need to move arm upward with gripper open.": 36}}